---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
source: html/0856015b-a7d4-7d2e-3119-1c41137b7610.htm
---
# RebarShapeConstraintArcLength Members

Create an arc-length constraint.